garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
      <edc:DCRDef edc:access="-nnnnnnn" edc:cname="CONFIG5" edc:desc="Configuration byte 5" edc:factorydefault="0xff" edc:impl="0x7f" edc:name="CONFIG5" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x7F" edc:default="0xff" edc:_addr="0x300004">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTCPS" edc:desc="WDT Period selection bits" edc:mask="0x1f" edc:name="WDTCPS" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="WDTCPS_0" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_1" edc:desc="Divider ratio 1:64" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_2" edc:desc="Divider ratio 1:128" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_3" edc:desc="Divider ratio 1:256" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_4" edc:desc="Divider ratio 1:512" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_5" edc:desc="Divider ratio 1:1024" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_6" edc:desc="Divider ratio 1:2048" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_7" edc:desc="Divider ratio 1:4096" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_8" edc:desc="Divider ratio 1:8192" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_9" edc:desc="Divider ratio 1:16384" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_10" edc:desc="Divider ratio 1:32768" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_11" edc:desc="Divider ratio 1:65536" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_12" edc:desc="Divider ratio 1:131072" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_13" edc:desc="Divider ratio 1:262144" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_14" edc:desc="Divider ratio 1:524299" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_15" edc:desc="Divider ratio 1:1048576" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_16" edc:desc="Divider ratio 1:2097152" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_17" edc:desc="Divider ratio 1:4194304" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_18" edc:desc="Divider ratio 1:8388608" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_19" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_20" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_21" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_22" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_23" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_24" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_25" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_26" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_27" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_28" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_29" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_30" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_31" edc:desc="Divider ratio 1:65536; software control of WDTPS" edc:when="(field &amp; 0x1f) == 0x1f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="WDT operating mode" edc:mask="0x3" edc:name="WDTE" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled; SEN is ignored" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SEN" edc:desc="WDT enabled/disabled by SEN bit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="NSLEEP" edc:desc="WDT enabled while sleep=0, suspended when sleep=1; SEN ignored" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled regardless of sleep; SEN is ignored" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--nnnnnn" edc:cname="CONFIG6" edc:desc="Configuration byte 6" edc:factorydefault="0xFF" edc:impl="0x3f" edc:name="CONFIG6" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x3F" edc:default="0xFF" edc:_addr="0x300005">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTCWS" edc:desc="WDT Window Select bits" edc:mask="0x7" edc:name="WDTCWS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="WDTCWS_0" edc:desc="window delay = 87.5; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_1" edc:desc="window delay = 75 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_2" edc:desc="window delay = 62.5 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_3" edc:desc="window delay = 50 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_4" edc:desc="window delay = 37.5 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_5" edc:desc="window delay = 25 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_6" edc:desc="window always open (100%); no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_7" edc:desc="window always open (100%); software control; keyed access not required" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTCCS" edc:desc="WDT input clock selector" edc:mask="0x7" edc:name="WDTCCS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="LFINTOSC" edc:desc="WDT reference clock is the 31.0 kHz LFINTOSC (when WDTE != 0b00)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MFINTOSC" edc:desc="WDT reference clock is the 31.25kHz MFINTOSC output (when WDTE != 0b00)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="WDT reference clock is SOSC (when WDTE != 0b00)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SC" edc:desc="Software Control (when WDTE != 0b00)" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------n" edc:cname="CONFIG7" edc:desc="Configuration byte 7" edc:factorydefault="0xFF" edc:impl="0x1" edc:name="CONFIG7" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x3" edc:default="0xFF" edc:_addr="0x300006">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="VDDIO2MD" edc:desc="VDDIO2 supply mode bit" edc:mask="0x1" edc:name="VDDIO2MD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="STANDARD_RANGE" edc:desc="Standard Operating Range (VDDIO2 &gt;= 1.62V)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LOW_VOLTAGE_RANGE" edc:desc="Low-voltage Operating Range (VDDIO2 &lt; 1.62V)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
