garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
        <edc:JoinedSFRDef edc:cname="NVMDAT" edc:desc="" edc:name="NVMDAT" edc:nzwidth="0x10" edc:_addr="0x5E">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMDATL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x5E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMDATL" edc:mask="0xff" edc:name="NVMDATL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMDAT0" edc:mask="0x1" edc:name="NVMDAT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT1" edc:mask="0x1" edc:name="NVMDAT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT2" edc:mask="0x1" edc:name="NVMDAT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT3" edc:mask="0x1" edc:name="NVMDAT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT4" edc:mask="0x1" edc:name="NVMDAT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT5" edc:mask="0x1" edc:name="NVMDAT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT6" edc:mask="0x1" edc:name="NVMDAT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT7" edc:mask="0x1" edc:name="NVMDAT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMDATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMDATH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x5F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMDATH" edc:mask="0xff" edc:name="NVMDATH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMDAT8" edc:mask="0x1" edc:name="NVMDAT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT9" edc:mask="0x1" edc:name="NVMDAT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT10" edc:mask="0x1" edc:name="NVMDAT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT11" edc:mask="0x1" edc:name="NVMDAT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT12" edc:mask="0x1" edc:name="NVMDAT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT13" edc:mask="0x1" edc:name="NVMDAT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT14" edc:mask="0x1" edc:name="NVMDAT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT15" edc:mask="0x1" edc:name="NVMDAT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCDATA" edc:desc="" edc:name="CRCDATA" edc:nzwidth="0x10" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x60">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATAL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCDATAL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x60">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xff" edc:name="DATA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DATA0" edc:mask="0x1" edc:name="DATA0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA1" edc:mask="0x1" edc:name="DATA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA2" edc:mask="0x1" edc:name="DATA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA3" edc:mask="0x1" edc:name="DATA3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA4" edc:mask="0x1" edc:name="DATA4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA5" edc:mask="0x1" edc:name="DATA5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA6" edc:mask="0x1" edc:name="DATA6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA7" edc:mask="0x1" edc:name="DATA7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATAH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCDATAH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x61">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xff" edc:name="DATA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DATA8" edc:mask="0x1" edc:name="DATA8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA9" edc:mask="0x1" edc:name="DATA9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA10" edc:mask="0x1" edc:name="DATA10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA11" edc:mask="0x1" edc:name="DATA11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA12" edc:mask="0x1" edc:name="DATA12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA13" edc:mask="0x1" edc:name="DATA13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA14" edc:mask="0x1" edc:name="DATA14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA15" edc:mask="0x1" edc:name="DATA15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
