garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
        <edc:SFRDef edc:access="nnn-----" edc:cname="I3C1PIE1" edc:desc="I3C GENERAL INTERRUPT ENABLE REGISTER 1" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="I3C1PIE1" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x8F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IBIDONEIE" edc:mask="0x1" edc:name="IBIDONEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DACHIE" edc:mask="0x1" edc:name="DACHIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCOMPIE" edc:mask="0x1" edc:name="TCOMPIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1ERRIE0" edc:desc="I3C ERROR INTERRUPT ENABLE REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1ERRIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x90">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCCCIE" edc:mask="0x1" edc:name="UCCCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIE" edc:mask="0x1" edc:name="BTOIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUSEIE" edc:mask="0x1" edc:name="BUSEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBIEIE" edc:mask="0x1" edc:name="IBIEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HJEIE" edc:mask="0x1" edc:name="HJEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIE" edc:mask="0x1" edc:name="RXOIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIE" edc:mask="0x1" edc:name="TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CNACKIE" edc:mask="0x1" edc:name="I2CNACKIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C1ERRIE1" edc:desc="I3C ERROR INTERRUPT ENABLE REGISTER 1" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C1ERRIE1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x91">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXREIE" edc:mask="0x1" edc:name="RXREIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWEIE" edc:mask="0x1" edc:name="TXWEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWLOEIE" edc:mask="0x1" edc:name="MWLOEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABEIE" edc:mask="0x1" edc:name="ABEIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C1BIDL" edc:desc="I3C BUS IDLE CONDITION THRESHOLD REGISTER" edc:name="I3C1BIDL" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x92">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1BIDLL" edc:desc="I3C BUS IDLE CONDITION THRESHOLD LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1BIDLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x92">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BIDLL" edc:mask="0xff" edc:name="BIDLL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1BIDLH" edc:desc="I3C BUS IDLE CONDITION THRESHOLD HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1BIDLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x93">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BIDLH" edc:mask="0xff" edc:name="BIDLH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1BAVL" edc:desc="I3C BUS AVAILABLE CONDITION THRESHOLD REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1BAVL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x94">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BAVL" edc:mask="0xff" edc:name="BAVL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C1BTO" edc:desc="I3C BUS TIMEOUT THRESHOLD" edc:name="I3C1BTO" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x95">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1BTOL" edc:desc="I3C BUS TIMEOUT THRESHOLD LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1BTOL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x95">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BTOL" edc:mask="0xff" edc:name="BTOL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1BTOH" edc:desc="I3C BUS TIMEOUT THRESHOLD HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1BTOH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x96">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BTOH" edc:mask="0xff" edc:name="BTOH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1IBIMDB" edc:desc="I3C IN-BAND INTERRUPT MANDATORY DATA BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1IBIMDB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x97">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIMDB" edc:mask="0xff" edc:name="IBIMDB" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IBIMDB_4_0" edc:mask="0x1f" edc:name="IBIMDB_4_0" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="IBIMDB_7_5" edc:mask="0x7" edc:name="IBIMDB_7_5" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1RETRY" edc:desc="I3C ARBITRATION REQUEST RETRY LIMIT REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1RETRY" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x98">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RETRY" edc:mask="0xff" edc:name="RETRY" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rn" edc:cname="I3C1FEAT" edc:desc="I3C FEATURES REGISTER" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="I3C1FEAT" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x99">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HJCAP" edc:mask="0x1" edc:name="HJCAP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HDRCAP" edc:mask="0x1" edc:name="HDRCAP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="I3C1SADR" edc:desc="I3C STATIC ADDRESS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="I3C1SADR" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SADR" edc:mask="0x7f" edc:name="SADR" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="I3C1DADR" edc:desc="I3C DYNAMIC ADDRESS REGISTER" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="I3C1DADR" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DADR" edc:mask="0x7f" edc:name="DADR" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
