garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1DCR" edc:desc="I3C DEVICE CHARACTERISTICS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11000110" edc:name="I3C1DCR" edc:nzwidth="8" edc:por="11000110" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DCR" edc:mask="0xff" edc:name="DCR" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnr-nnnn" edc:cname="I3C1DSTAT0" edc:desc="I3C DEVICE STATUS REGISTER 0" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="I3C1DSTAT0" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xAA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTPEND" edc:desc="Data/Address bit" edc:mask="0xf" edc:name="INTPEND" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PERR" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTMODE" edc:mask="0x3" edc:name="ACTMODE" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INPEND0" edc:mask="0x1" edc:name="INPEND0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTPEND1" edc:mask="0x1" edc:name="INTPEND1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTPEND2" edc:mask="0x1" edc:name="INTPEND2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTPEND3" edc:mask="0x1" edc:name="INTPEND3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ACTMODE0" edc:mask="0x1" edc:name="ACTMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTMODE1" edc:mask="0x1" edc:name="ACTMODE1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1DSTAT1" edc:desc="I3C DEVICE STATUS REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1DSTAT1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xAB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VRSV" edc:mask="0xff" edc:name="VRSV" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VRSV0" edc:mask="0x1" edc:name="VRSV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV1" edc:mask="0x1" edc:name="VRSV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV2" edc:mask="0x1" edc:name="VRSV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV3" edc:mask="0x1" edc:name="VRSV3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV4" edc:mask="0x1" edc:name="VRSV4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV5" edc:mask="0x1" edc:name="VRSV5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV6" edc:mask="0x1" edc:name="VRSV6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV7" edc:mask="0x1" edc:name="VRSV7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MWS" edc:desc="I3C MAXIMUM WRITE SPEED REGISTER" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MWS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MWS0" edc:mask="0x1" edc:name="MWS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MWS1" edc:mask="0x1" edc:name="MWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS2" edc:mask="0x1" edc:name="MWS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS3" edc:mask="0x1" edc:name="MWS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS4" edc:mask="0x1" edc:name="MWS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS5" edc:mask="0x1" edc:name="MWS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS6" edc:mask="0x1" edc:name="MWS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS7" edc:mask="0x1" edc:name="MWS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MWS_2_0" edc:mask="0x7" edc:name="MWS_2_0" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS_7_4" edc:mask="0xf" edc:name="MWS_7_4" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MRS" edc:desc="I3C MAXIMUM READ SPEED REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MRS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MRS0" edc:mask="0x1" edc:name="MRS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MRS1" edc:mask="0x1" edc:name="MRS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS2" edc:mask="0x1" edc:name="MRS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS3" edc:mask="0x1" edc:name="MRS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS4" edc:mask="0x1" edc:name="MRS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS5" edc:mask="0x1" edc:name="MRS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS6" edc:mask="0x1" edc:name="MRS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS7" edc:mask="0x1" edc:name="MRS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MRS_2_0" edc:mask="0x7" edc:name="MRS_2_0" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="MRS_5_3" edc:mask="0x7" edc:name="MRS_5_3" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C1MRT" edc:desc="I3C MAXIMUM READ TURNAROUND TIME" edc:name="I3C1MRT" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xAE">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MRTL" edc:desc="I3C MAXIMUM READ TURNAROUND LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MRTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xAE">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRTL" edc:mask="0xff" edc:name="MRTL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MRTH" edc:desc="I3C MAXIMUM READ TURNAROUND HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MRTH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xAF">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRTH" edc:mask="0xff" edc:name="MRTH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
