garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x132"/>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x133">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16ATMRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ATMRT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x133">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRT" edc:mask="0xff" edc:name="TMRT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRT0" edc:mask="0x1" edc:name="TMRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT1" edc:mask="0x1" edc:name="TMRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT2" edc:mask="0x1" edc:name="TMRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT3" edc:mask="0x1" edc:name="TMRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT4" edc:mask="0x1" edc:name="TMRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT5" edc:mask="0x1" edc:name="TMRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT6" edc:mask="0x1" edc:name="TMRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT7" edc:mask="0x1" edc:name="TMRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16ATMRT0" edc:mask="0x1" edc:name="TU16ATMRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRT1" edc:mask="0x1" edc:name="TU16ATMRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRT2" edc:mask="0x1" edc:name="TU16ATMRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRT3" edc:mask="0x1" edc:name="TU16ATMRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRT4" edc:mask="0x1" edc:name="TU16ATMRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRT5" edc:mask="0x1" edc:name="TU16ATMRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRT6" edc:mask="0x1" edc:name="TU16ATMRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRT7" edc:mask="0x1" edc:name="TU16ATMRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16ATMR24" edc:mask="0x1" edc:name="TU16ATMR24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR25" edc:mask="0x1" edc:name="TU16ATMR25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR26" edc:mask="0x1" edc:name="TU16ATMR26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR27" edc:mask="0x1" edc:name="TU16ATMR27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR28" edc:mask="0x1" edc:name="TU16ATMR28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR29" edc:mask="0x1" edc:name="TU16ATMR29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR30" edc:mask="0x1" edc:name="TU16ATMR30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR31" edc:mask="0x1" edc:name="TU16ATMR31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16ACRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ACRT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x133">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRT" edc:mask="0xff" edc:name="CRT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRT0" edc:mask="0x1" edc:name="CRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT1" edc:mask="0x1" edc:name="CRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT2" edc:mask="0x1" edc:name="CRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT3" edc:mask="0x1" edc:name="CRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT4" edc:mask="0x1" edc:name="CRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT5" edc:mask="0x1" edc:name="CRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT6" edc:mask="0x1" edc:name="CRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT7" edc:mask="0x1" edc:name="CRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16ACRT0" edc:mask="0x1" edc:name="TU16ACRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRT1" edc:mask="0x1" edc:name="TU16ACRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRT2" edc:mask="0x1" edc:name="TU16ACRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRT3" edc:mask="0x1" edc:name="TU16ACRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRT4" edc:mask="0x1" edc:name="TU16ACRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRT5" edc:mask="0x1" edc:name="TU16ACRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRT6" edc:mask="0x1" edc:name="TU16ACRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRT7" edc:mask="0x1" edc:name="TU16ACRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16ACR24" edc:mask="0x1" edc:name="TU16ACR24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR25" edc:mask="0x1" edc:name="TU16ACR25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR26" edc:mask="0x1" edc:name="TU16ACR26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR27" edc:mask="0x1" edc:name="TU16ACR27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR28" edc:mask="0x1" edc:name="TU16ACR28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR29" edc:mask="0x1" edc:name="TU16ACR29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR30" edc:mask="0x1" edc:name="TU16ACR30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR31" edc:mask="0x1" edc:name="TU16ACR31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="TU16APR" edc:desc="" edc:name="TU16APR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x134">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x134">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRL0" edc:mask="0x1" edc:name="PRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL1" edc:mask="0x1" edc:name="PRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL2" edc:mask="0x1" edc:name="PRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL3" edc:mask="0x1" edc:name="PRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL4" edc:mask="0x1" edc:name="PRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL5" edc:mask="0x1" edc:name="PRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL6" edc:mask="0x1" edc:name="PRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL7" edc:mask="0x1" edc:name="PRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16APRL0" edc:mask="0x1" edc:name="TU16APRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL1" edc:mask="0x1" edc:name="TU16APRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL2" edc:mask="0x1" edc:name="TU16APRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL3" edc:mask="0x1" edc:name="TU16APRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL4" edc:mask="0x1" edc:name="TU16APRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL5" edc:mask="0x1" edc:name="TU16APRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL6" edc:mask="0x1" edc:name="TU16APRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL7" edc:mask="0x1" edc:name="TU16APRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16APR0" edc:mask="0x1" edc:name="TU16APR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR1" edc:mask="0x1" edc:name="TU16APR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR2" edc:mask="0x1" edc:name="TU16APR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR3" edc:mask="0x1" edc:name="TU16APR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR4" edc:mask="0x1" edc:name="TU16APR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR5" edc:mask="0x1" edc:name="TU16APR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR6" edc:mask="0x1" edc:name="TU16APR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR7" edc:mask="0x1" edc:name="TU16APR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
