garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
        <edc:AdjustPoint edc:offset="0x3" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39A"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS" edc:mask="0x1f" edc:name="CLCIN0PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS0" edc:mask="0x1" edc:name="CLCIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS1" edc:mask="0x1" edc:name="CLCIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS2" edc:mask="0x1" edc:name="CLCIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS3" edc:mask="0x1" edc:name="CLCIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS4" edc:mask="0x1" edc:name="CLCIN0PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="---10100" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:mask="0x1f" edc:name="CLCIN1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS0" edc:mask="0x1" edc:name="CLCIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS1" edc:mask="0x1" edc:name="CLCIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS2" edc:mask="0x1" edc:name="CLCIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS3" edc:mask="0x1" edc:name="CLCIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS4" edc:mask="0x1" edc:name="CLCIN1PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="---10001" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:mask="0x1f" edc:name="CLCIN2PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS0" edc:mask="0x1" edc:name="CLCIN2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS1" edc:mask="0x1" edc:name="CLCIN2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS2" edc:mask="0x1" edc:name="CLCIN2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS3" edc:mask="0x1" edc:name="CLCIN2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS4" edc:mask="0x1" edc:name="CLCIN2PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="---00101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:mask="0x1f" edc:name="CLCIN3PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS0" edc:mask="0x1" edc:name="CLCIN3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS1" edc:mask="0x1" edc:name="CLCIN3PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS2" edc:mask="0x1" edc:name="CLCIN3PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS3" edc:mask="0x1" edc:name="CLCIN3PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS4" edc:mask="0x1" edc:name="CLCIN3PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U1CTSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U1CTSPPS" edc:nzwidth="8" edc:por="---10100" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1CTSPPS" edc:mask="0x1f" edc:name="U1CTSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1CTSPPS0" edc:mask="0x1" edc:name="U1CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS1" edc:mask="0x1" edc:name="U1CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS2" edc:mask="0x1" edc:name="U1CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS3" edc:mask="0x1" edc:name="U1CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS4" edc:mask="0x1" edc:name="U1CTSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
