garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SPI1SSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SPI1SSPPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS" edc:mask="0x1f" edc:name="SPI1SSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS0" edc:mask="0x1" edc:name="SPI1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS1" edc:mask="0x1" edc:name="SPI1SSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS2" edc:mask="0x1" edc:name="SPI1SSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS3" edc:mask="0x1" edc:name="SPI1SSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS4" edc:mask="0x1" edc:name="SPI1SSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AA"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="I2C1SCLPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="I2C1SCLPPS" edc:nzwidth="8" edc:por="---10000" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS" edc:mask="0x1f" edc:name="I2C1SCLPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS0" edc:mask="0x1" edc:name="I2C1SCLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS1" edc:mask="0x1" edc:name="I2C1SCLPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS2" edc:mask="0x1" edc:name="I2C1SCLPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS3" edc:mask="0x1" edc:name="I2C1SCLPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS4" edc:mask="0x1" edc:name="I2C1SCLPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="I2C1SDAPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="I2C1SDAPPS" edc:nzwidth="8" edc:por="---10001" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS" edc:mask="0x1f" edc:name="I2C1SDAPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS0" edc:mask="0x1" edc:name="I2C1SDAPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS1" edc:mask="0x1" edc:name="I2C1SDAPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS2" edc:mask="0x1" edc:name="I2C1SDAPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS3" edc:mask="0x1" edc:name="I2C1SDAPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS4" edc:mask="0x1" edc:name="I2C1SDAPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AF"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADACTPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ADACTPPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_14p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3B1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACTPPS" edc:mask="0x1f" edc:name="ADACTPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACTPPS0" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS1" edc:mask="0x1" edc:name="ADACTPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS2" edc:mask="0x1" edc:name="ADACTPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS3" edc:mask="0x1" edc:name="ADACTPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS4" edc:mask="0x1" edc:name="ADACTPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x3B2"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x4" edc:beginaddr="0x0400" edc:endaddr="0x0460" edc:regionid="sfr4">
        <edc:AdjustPoint edc:offset="0x16" edc:_addr="0x400"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="ANSELA" edc:nzwidth="8" edc:por="--11-111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x416">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELA0" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA1" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA2" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSELA4" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA5" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WPUA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="WPUA" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x417">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUA0" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA1" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA2" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA3" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA4" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA5" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
