garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="ODCONA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-000" edc:name="ODCONA" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x418">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCA0" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA1" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA2" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCA4" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA5" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="SLRCONA" edc:nzwidth="8" edc:por="--11-111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x419">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRA0" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA1" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA2" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRA4" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA5" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="INLVLA" edc:nzwidth="8" edc:por="--111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAP" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAP" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x41E"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x420"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x421"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x422"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x423"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x424"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x425"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x426"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x427"/>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x428"/>
        <edc:SFRDef edc:access="nnnnn---" edc:cname="ANSELC" edc:desc="" edc:impl="0xf8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111---" edc:name="ANSELC" edc:nzwidth="8" edc:por="11111---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSELC3" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC4" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC5" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC6" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC7" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
