garyPenhook/PIC-Assembler/edc/PIC18F06Q20.PIC
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="WPUC" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="WPUC" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUC0" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC1" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WPUC3" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC4" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC5" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC6" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC7" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="ODCONC" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="ODCONC" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCC0" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC1" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCC3" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC4" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC5" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC6" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC7" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="SLRCONC" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111-11" edc:name="SLRCONC" edc:nzwidth="8" edc:por="11111-11" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRC0" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC1" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRC3" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC4" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC5" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC6" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC7" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="INLVLC" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111-11" edc:name="INLVLC" edc:nzwidth="8" edc:por="11111-11" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLC0" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC1" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC3" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC4" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC5" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC6" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC7" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="IOCCP" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="IOCCP" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP6" edc:mask="0x1" edc:name="IOCCP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP7" edc:mask="0x1" edc:name="IOCCP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="IOCCN" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="IOCCN" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x430">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN6" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN7" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
